gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_F000.cpp

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"

#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_SETLIB.h"
#include "../DL698/DL698_GET.h"
#include "../DL698/DL698_GET_F000.h"
#include "../Calculate/Calculate.h"
#include "../DL698/Info_3762.h"

u32 Get_Request_4500(u32 PORTn,u32 OAD,u8 *p8tx,u32 LENmax_TxSPACE)//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
{
	u8 *p8s;
	u32 Len;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->DAR=0;//数据访问结果;成功
	if(LENmax_TxSPACE<2)
	{
		GET_Request_Frame(PORTn);//分帧标志
		return 0;
	}
	
	p8s=(u8*)ADDR_45000C00;
	p8tx[0]=DataType_visible_string;
	p8tx[1]=0x1A;
	
	//type=
	p8tx[2] = 0x74;
	p8tx[3] = 0x79;
	p8tx[4] = 0x70;
	p8tx[5] = 0x65;
	p8tx[6] = 0x3d;
	
	//模块类型 3f写死
	p8tx[7] = 0x33;
	p8tx[8] = 0x66;
	
	p8tx[9] = 0x3b;
	
	//id=
	p8tx[10] = 0x69;
	p8tx[11] = 0x64;
	p8tx[12] = 0x3d;
	
	MR((u32)p8tx+13,(u32)p8s+2,15);
	Len=0x1C;
	return Len;
}

u32 GET_Request_F200(DL698_SETLIB_TypeDef *pLib,u32 PORTn,u32 OAD,u8 *p8tx,u32 LENmax_TxSPACE)//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 Len;
	u8* p8s;
	u8* p8s1;
	u8* p8s2;
	u8* p8s3;
	u8* p8d;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 Array;
	u32 NUMmax;
	u32 n;
	u32 m,M;
	u32 j,k,L;
//	u32 data;

	Array=Array;
	NUMmax=NUMmax;
	n=n;
	m=m;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->DAR=0;//数据访问结果;成功
	if(LENmax_TxSPACE<2)
	{
		GET_Request_Frame(PORTn);//分帧标志
		return 0;
	}
	p8tx[0]=DataType_array;
	p8tx[1]=0;
	Len=2;
	switch(OAD>>16)//OI
	{
		case 0xF200://设备对象-RS232
			switch((OAD>>8)&0xff)//属性
			{
				case 2:
					//属性2（设备对象列表，只读）∷=array 端口
					//端口∷=structure
					//{
					//  端口描述符 visible-string，
					//端口参数   COMDCB，
					//端口功能   enum{上行通信（0），抄表（1），级联（2），停用（3）}
					//}
					if(LENmax_TxSPACE<19)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8tx[1]=1;//数组数
					p8tx[Len+0]=DataType_structure;
					p8tx[Len+1]=3;
					p8tx[Len+2]=DataType_visible_string;
					p8tx[Len+3]=5;
					p8tx[Len+4]='R';
					p8tx[Len+5]='S';
					p8tx[Len+6]='2';
					p8tx[Len+7]='3';
					p8tx[Len+8]='2';
					p8tx[Len+9]=DataType_COMDCB;
					Len+=10;
					MR((u32)p8tx+Len,ADDR_F200_2+8,5);
					Len+=5;
					p8tx[Len+0]=DataType_enum;
					Len+=1;
					MR((u32)p8tx+Len,ADDR_F200_2+14,1);
					Len+=1;
					return Len;
				default:
					UARTCtrl->DAR=6;//对象不存在
					return 0;
			}
			//return 0;
		case 0xF201://设备对象-RS485
			switch((OAD>>8)&0xff)//属性
			{
				case 2:
					//属性2（设备对象列表，只读）∷=array 端口
					//端口∷=structure
					//{
					//  端口描述符 visible-string，
					//端口参数   COMDCB，
					//端口功能   enum{上行通信（0），抄表（1），级联（2），停用（3）}
					//}
					if(LENmax_TxSPACE<40)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8tx[1]=2;//数组数
					//485-1
					p8tx[Len+0]=DataType_structure;
					p8tx[Len+1]=3;
					p8tx[Len+2]=DataType_visible_string;
					p8tx[Len+3]=7;
					p8tx[Len+4]='R';
					p8tx[Len+5]='S';
					p8tx[Len+6]='4';
					p8tx[Len+7]='8';
					p8tx[Len+8]='5';
					p8tx[Len+9]='-';
					p8tx[Len+10]='1';
					p8tx[Len+11]=DataType_COMDCB;
					Len+=12;
					MR((u32)p8tx+Len,ADDR_F201_2+8,5);
					Len+=5;
					p8tx[Len+0]=DataType_enum;
					Len+=1;
					MR((u32)p8tx+Len,ADDR_F201_2+14,1);
					Len+=1;
					//485-2
					p8tx[Len+0]=DataType_structure;
					p8tx[Len+1]=3;
					p8tx[Len+2]=DataType_visible_string;
					p8tx[Len+3]=7;
					p8tx[Len+4]='R';
					p8tx[Len+5]='S';
					p8tx[Len+6]='4';
					p8tx[Len+7]='8';
					p8tx[Len+8]='5';
					p8tx[Len+9]='-';
					p8tx[Len+10]='2';
					p8tx[Len+11]=DataType_COMDCB;
					Len+=12;
					MR((u32)p8tx+Len,ADDR_F201_2+LENper_F201_2+8,5);
					Len+=5;
					p8tx[Len+0]=DataType_enum;
					Len+=1;
					MR((u32)p8tx+Len,ADDR_F201_2+LENper_F201_2+14,1);
					Len+=1;
					return Len;
				default:
					UARTCtrl->DAR=6;//对象不存在
					return 0;
			}
			//return 0;
		case 0xF202://设备对象-红外
			switch((OAD>>8)&0xff)//属性
			{
				case 2:
					//属性2（设备对象列表，只读）∷=array 端口
					//端口∷=structure
					//{
					//  端口描述符 visible-string，
					//端口参数   COMDCB，
					//}
					if(LENmax_TxSPACE<17)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8tx[1]=1;//数组数
					p8tx[Len+0]=DataType_structure;
					p8tx[Len+1]=3;
					p8tx[Len+2]=DataType_visible_string;
					p8tx[Len+3]=5;
					p8tx[Len+4]='I';
					p8tx[Len+5]='R';
					p8tx[Len+6]=' ';
					p8tx[Len+7]=' ';
					p8tx[Len+8]=' ';
					p8tx[Len+9]=DataType_COMDCB;
					Len+=10;
					MR((u32)p8tx+Len,ADDR_F202_2+8,5);
					Len+=5;
					return Len;
				default:
					UARTCtrl->DAR=6;//对象不存在
					return 0;
			}
			//return 0;
		case 0xF203://开关量输入
			switch((OAD>>8)&0xff)//属性
			{
				case 0x42://状态量变位发生后状态
					i=OAD&0xff;
					if((i>NUMmax_SWITCHIN)||(i==0))
					{
						return 0;
					}
					if(LENmax_TxSPACE<6)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					i--;
					i*=6;
					i+=ADDR_F203_2+2;
					MR((u32)p8tx,i,6);
					return 6;
				default:
					UARTCtrl->DAR=6;//对象不存在
					return 0;
			}
			//reutrn 0;
		case 0xF204://直流模拟量
			return 0;
		case 0xF205://继电器输出
			//属性2（设备对象列表，只读）∷=array 继电器单元(在读通信时填写)
			//继电器单元∷=structure
			//{
			//  描述符    visible-string，
			//当前状态  enum{未输出（0），输出（1）}，
			//开关属性  enum{脉冲式（0），保持式（1）}，
			//接线状态  enum{接入（0），未接入（1) }
			//}
			p8d=(u8*)ADDR_F205_2;
			p8d[0]=DataType_array;
			p8d[1]=2;
			p8d+=2;
		//1
			p8d[0]=DataType_structure;
			p8d[1]=4;
			p8d[2]=DataType_visible_string;
			p8d[3]=0;
			p8d[4]=DataType_enum;//当前状态  enum{未输出（0），输出（1）}
			p8s=(u8*)ADDR_Terminal_Remote_State;//控制状态,0=上电或不控制,1=投入,2=...,100=报警,101=跳闸准备,102=跳闸,103=跳闸2分钟后
			if(p8s[0]<102)
			{
				p8d[5]=0;//{未输出（0），输出（1）}
			}
			else
			{
				p8d[5]=1;//{未输出（0），输出（1）}
			}
			p8d[6]=DataType_enum;//开关属性  enum{脉冲式（0），保持式（1）}
			p8d[7]=0;
			p8d[8]=DataType_enum;//接线状态  enum{接入（0），未接入（1) }
			p8s=(u8*)ADDR_ContrlUARTData;//控制模块输出输入数据
			if(p8s[2]&1)
			{
				p8d[9]=1;
			}
			else
			{
				p8d[9]=0;
			}
			p8d+=10;
		//2
			p8d[0]=DataType_structure;
			p8d[1]=4;
			p8d[2]=DataType_visible_string;
			p8d[3]=0;
			p8d[4]=DataType_enum;//当前状态  enum{未输出（0），输出（1）}
			p8s=(u8*)ADDR_Terminal_Remote_State+Terminal_Ctrl_Pn_Len;//控制状态,0=上电或不控制,1=投入,2=...,100=报警,101=跳闸准备,102=跳闸,103=跳闸2分钟后
			if(p8s[0]<102)
			{
				p8d[5]=0;//{未输出（0），输出（1）}
			}
			else
			{
				p8d[5]=1;//{未输出（0），输出（1）}
			}
			p8d[6]=DataType_enum;//开关属性  enum{脉冲式（0），保持式（1）}
			p8d[7]=0;
			p8d[8]=DataType_enum;//接线状态  enum{接入（0），未接入（1) }
			p8s=(u8*)ADDR_ContrlUARTData;//控制模块输出输入数据
			if(p8s[2]&4)
			{
				p8d[9]=1;
			}
			else
			{
				p8d[9]=0;
			}
			return 0;
		case 0xF206://告警输出
			//属性2（设备对象列表，只读）∷=array 告警输出(在读通信时填写)
			//告警输出∷=enum
			//{
			//未输出（0），输出（1）
			//}
	#if (Project/100)==2//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			p8d=(u8*)ADDR_F206_2;
			p8d[0]=DataType_array;
			p8d[1]=0;
	#endif
	#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			p8d=(u8*)ADDR_F206_2;
			p8d[0]=DataType_array;
			p8d[1]=1;
			p8d+=2;
			p8d[0]=DataType_enum;
			p8s=(u8*)ADDR_ContrlUARTData;//控制模块输出输入数据
//#define ADDR_ContrlUARTData     ADDR_Terminal_Total_State+4//控制模块输出输入数据
//1BYTE	要输出给控制模块的控制0:b0=轮次1继电器动作,b1=轮次1指示灯点红灯,b2=轮次1指示灯点绿灯,b3=轮次2继电器动作,b4=轮次2指示灯点红灯,b5=轮次2指示灯点绿灯,b6=功控指示灯点亮,b7=电控指示灯点亮
//1BYTE 要输出给控制模块的控制1:b0=告警继电器动作,b1=保电指示灯,b2-b6,b7=轮次继电器动作方式(0=脉冲1=内部自动测试时电平)
			if(p8s[1]&1)//b0=告警继电器动作
			{
				p8d[1]=1;
			}
			else
			{
				p8d[1]=0;
			}
	#endif
	#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
			if(Comm_Ram->MODE3in1==1)//三合一终端当前运行模式:0=专变,1=集中器
			{
				p8d=(u8*)ADDR_F206_2;
				p8d[0]=DataType_array;
				p8d[1]=0;
			}
			else
			{
				p8d=(u8*)ADDR_F206_2;
				p8d[0]=DataType_array;
				p8d[1]=1;
				p8d+=2;
				p8d[0]=DataType_enum;
				p8s=(u8*)ADDR_ContrlUARTData;//控制模块输出输入数据
//#define ADDR_ContrlUARTData     ADDR_Terminal_Total_State+4//控制模块输出输入数据
//1BYTE	要输出给控制模块的控制0:b0=轮次1继电器动作,b1=轮次1指示灯点红灯,b2=轮次1指示灯点绿灯,b3=轮次2继电器动作,b4=轮次2指示灯点红灯,b5=轮次2指示灯点绿灯,b6=功控指示灯点亮,b7=电控指示灯点亮
//1BYTE 要输出给控制模块的控制1:b0=告警继电器动作,b1=保电指示灯,b2-b6,b7=轮次继电器动作方式(0=脉冲1=内部自动测试时电平)
			if(p8s[1]&1)//b0=告警继电器动作
				{
					p8d[1]=1;
				}
				else
				{
					p8d[1]=0;
				}
			}
	#endif
			return 0;
			
		case 0xF207://多功能端子
			return 0;
		
		case 0xF209://载波/微功率无线接口
			switch((OAD>>8)&0xff)//属性
			{
			#if (((Project/100)==2)||((Project/100)==4))//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
				case 2:
					//属性2（设备对象列表，只读）∷=array 本地通信模块单元
					//本地通信模块单元∷=structure
					//{
					//端口描述符   visible-string，
					//通信参数     COMDCB，
					//版本信息     VersionInfo
					//}
					//VersionInfo∷=structure
					//{
					//  厂商代码    visible-string(SIZE(2))，
					//  芯片代码    visible-string(SIZE(2))，
					//  版本日期     Date，
					//  软件版本     long-unsigned
					//}
					Len=Get_DL698DataLen_S((u8*)ADDR_F209_2,0);//得到DL698数据类型长度(包括:类型字节和数据);
					if(LENmax_TxSPACE<Len)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					// 端口描述符
					p8s=UART_3762_AFNxFn(0x03,12);
					M=p8s[2];
					MR((u32)p8tx,ADDR_F209_2,Len);
		
					//端口描述符	visible-string
					p8tx[4] = DataType_visible_string;
					p8tx[5] = 129; 
					p8tx[6] = 105+2*M; 
					//type=
					p8tx[7] = 0x74;
					p8tx[8] = 0x79;
					p8tx[9] = 0x70;
					p8tx[10] = 0x65;
					p8tx[11] = 0x3d;
					
					//模块类型 PLC写死
					p8tx[12] = 0x50;
					p8tx[13] = 0x4c;
					p8tx[14] = 0x43;

					// ;
					p8tx[15] = 0x3b;

					//mfrs=
					p8tx[16] = 0x6d;
					p8tx[17] = 0x66;
					p8tx[18] = 0x72;
					p8tx[19] = 0x73;
					p8tx[20] = 0x3d;

					// 厂商代码
					i=p8s[0]+(p8s[1]<<8);
					p8tx[21]=i>>8;
					p8tx[22]=i;

					//;
					p8tx[23] = 0x3b; 
					
					//idformat=
					p8tx[24] = 0x69; 
					p8tx[25] = 0x64; 
					p8tx[26] = 0x66; 
					p8tx[27] = 0x6f; 
					p8tx[28] = 0x72; 
					p8tx[29] = 0x6d; 
					p8tx[30] = 0x61; 
					p8tx[31] = 0x74; 
					p8tx[32] = 0x3d; 

