gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_F000.cpp
					// bcd bin ascll
					p8tx[33] = 0x32;

					// ；
					p8tx[34] = 0x3b;

					// id =
					p8tx[35] = 0x69;
					p8tx[36] = 0x64;
					p8tx[37] = 0x3d;
					MR((u32)(p8tx + 38 + 49),(ADDR_AFN10F112 + 9),24);
					Data_Inverse((u32)p8tx+87,24);
					HexToASCII(&p8tx[87],&p8tx[38],24);

					// ；
					p8tx[62 + 24] = 0x3b;	

					// mmfrs=
					p8tx[63+ 24] = 0x6d;
					p8tx[64+ 24] = 0x6d;
					p8tx[65+ 24] = 0x66;
					p8tx[66+ 24] = 0x72;
					p8tx[67+ 24] = 0x73;
					p8tx[68+ 24] = 0x3d;

					//  模块厂商代码
					i=p8s[0]+(p8s[1]<<8);
					p8tx[69+ 24]=i>>8;
					p8tx[70+ 24]=i;

					// ；
					p8tx[71+ 24] = 0x3b;

					// midformat=
					p8tx[72+ 24] = 0x6d;
					p8tx[73+ 24] = 0x69;
					p8tx[74+ 24] = 0x64;
					p8tx[75+ 24] = 0x66;
					p8tx[76+ 24] = 0x6f;
					p8tx[77+ 24] = 0x72;
					p8tx[78+ 24] = 0x6d;
					p8tx[79+ 24] = 0x61;
					p8tx[80+ 24] = 0x74;
					p8tx[81+ 24] = 0x3d;

					// 02
					p8tx[82+ 24] = 0x31;

					// ;
					p8tx[83+ 24] = 0x3b;
					
					//mid =
					p8tx[84+ 24] = 0x6d;
					p8tx[85+ 24] = 0x69;
					p8tx[86+ 24] = 0x64;
					p8tx[87+ 24] = 0x3d;

					// 模块ID信息	
					Data_Inverse((u32)p8s+4,M);	
					HexToASCII(&p8s[4],&p8tx[112],M);
//					p8s2 = (u8*)ADDR_F209_2;
					MR((u32)(p8tx+6+128),(ADDR_F209_2 + 6),Len-6);

					// 芯片厂商代码
					p8tx[21] = p8tx[6+128+14];
					p8tx[22] = p8tx[6+128+15];
					Len+=128;
					return Len;
				case 5:
					//属性5（从节点对象列表，只读）∷=array 从节点单元
					//从节点单元	属性2∷=structure
					//{
					//  从节点序号      long-unsigned,
					//  从节点通信地址  octet-string,
					//  从节点描述符    visible-string
					//}
					//每节点字节数=2+3+8+2=15
					p8tx[0]=DataType_array;
					Len=2;
					Array=0;//填入配置组数
#if(USER/100)==17//江苏系
					p8s1=(u8*)ADDR_AFN10F7;
					NUMmax = p8s1[0];
					NUMmax |=p8s1[1]<<8;

#else
					NUMmax=Terminal_Router->NoteNum;//当前路由器中已知总从节点数(半字对齐)
#endif	
					n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
					while(1)
					{
						if(n>=NUMmax)
						{
							break;
						}
						if((Array>=127)||(LENmax_TxSPACE<171))
						{//发送缓冲不够,分帧
							if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
							{
								UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
							}
							else
							{
								UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
							}
							UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
							p8tx[1]=Array;//填入配置组数
							return Len;
						}
					//F210从节点单元	属性2∷=structure
						p8tx[Len+0]=DataType_structure;
						p8tx[Len+1]=3;
					//{
					//  从节点序号      long-unsigned,
						p8tx[Len+2]=DataType_long_unsigned;
						p8tx[Len+3]=(n+1)>>8;
						p8tx[Len+4]=n+1;
					//  从节点通信地址  octet-string,
						p8tx[Len+5]=DataType_octet_string;
						p8tx[Len+6]=6;
						MR((u32)p8tx+Len+7,ADDR_AFN10F7+2+(n*61),6);
						p8s1=(u8*)ADDR_AFN10F7;
						for(j=0;j<NUM_RMmax;j++)
						{
							if(Compare_DL698DataString(p8s1 + 2 + 61 * j ,p8tx+Len+7, 6) == 0)
							{
								break;
							}
						}
						p8s2= (u8*)ADDR_AFN10F104;
						for(L=0;L<NUM_RMmax;L++)
						{
							if(Compare_DL698DataString(p8s2 + 2 + 15 * L ,p8tx+Len+7, 6) == 0)
							{
								break;
							}
						}
						p8s3=(u8*)ADDR_AFN10F112;
						for(k=0;k<NUM_RMmax;k++)
						{
							if(Compare_DL698DataString(p8s3 + 2 + 33 * k ,p8tx+Len+7, 6) == 0)
							{
								break;
							}
						}

						
						Data_Inverse((u32)p8tx+Len+7,6);//数据倒序(高低字节调换),入口Le>=2

						M = p8s1[(61*j) + 9 +2];
	
					//  从节点描述符    visible-string
						p8tx[Len+13]=DataType_visible_string;
#if 0					
						if(n==0)
						{
							p8tx[Len+14]=108;
						}
						else
						{
							p8tx[Len+14]=129;
							p8tx[Len+15]=128;
						}
#else						
						p8tx[Len+14]=129;
						p8tx[Len+15]=103+2*M;
#endif

						//128 字节模块ID信息
						//type=
						p8tx[Len+16] = 0x74;
						p8tx[Len+17] = 0x79;
						p8tx[Len+18] = 0x70;
						p8tx[Len+19] = 0x65;
						p8tx[Len+20] = 0x3d;

#if 0
						//模块类型 PLC写死
						p8tx[Len+21] = 0x50;
						p8tx[Len+22] = 0x4c;
						p8tx[Len+23] = 0x43;
#else
						//HexToASCII(p8s3 + (33 * k) + 2 + 6,&p8tx[Len + 21],1);
						p8tx[Len+21]=(p8s3[(33 * k) + 2 + 6] + 0x30); 
#endif

						// ;
						p8tx[Len+22] = 0x3b;

						//mfrs=
						p8tx[Len+23] = 0x6d;
						p8tx[Len+24] = 0x66;
						p8tx[Len+25] = 0x72;
						p8tx[Len+26] = 0x73;
						p8tx[Len+27] = 0x3d;

						// 芯片厂商代码
#if 0
						if(n==0)
						{
							MR((u32)(p8tx+Len+30),(ADDR_F209_2 + 20),2);
						}
						else
						{
							MR((u32)(p8tx + Len + 30),(ADDR_AFN10F112 + 2 + 7 + 10 +(33 * n)) ,2);
						}
#else

						//节点总数量 BIN 2
						//节点1地址 BIN 6
						//节点1软件版本 BIN 2
						//节点1软件版本日期 BIN 3
						//节点1模块厂商代码 BIN 2
						//节点1芯片代码 BIN 2
						//...
						//节点n地址 BIN 6
						//节点n软件版本 BIN 2
						//节点n软件版本日期 BIN 3
						//节点n模块厂商代码 BIN 2
						//节点n芯片代码 BIN 2

						p8tx[Len+29]=p8s2[13+ 2 + 15*L];
						p8tx[Len+28]=p8s2[14+ 2 + 15*L];
//						Data_Inverse((u32)p8tx+Len+29,2);//数据倒序(高低字节调换),入口Le>=2 								
#endif
						//;
						p8tx[Len+30] = 0x3b; 
						
						//idformat=
						p8tx[Len+31] = 0x69; 
						p8tx[Len+32] = 0x64; 
						p8tx[Len+33] = 0x66; 
						p8tx[Len+34] = 0x6f; 
						p8tx[Len+35] = 0x72; 
						p8tx[Len+36] = 0x6d; 
						p8tx[Len+37] = 0x61; 
						p8tx[Len+38] = 0x74; 
						p8tx[Len+39] = 0x3d; 

						// bcd bin ascll
						p8tx[Len+40] = 0x32;

						// ；
						p8tx[Len+41] = 0x3b;

						// id =
						p8tx[Len+42] = 0x69;
						p8tx[Len+43] = 0x64;
						p8tx[Len+44] = 0x3d;

						//p8s2 = (u8*)ADDR_AFN10F112;
						MR((u32)(p8tx + Len + 45 + 49),(ADDR_AFN10F112 + 2 + 7 + (33 * k)) ,24);
						Data_Inverse((u32)p8tx+Len+94,24);
						HexToASCII(&p8tx[Len + 94],&p8tx[Len+45],24);

						// ；
						p8tx[Len + 93] = 0x3b;	

						// mmfrs=
						p8tx[Len + 94] = 0x6d;
						p8tx[Len + 95] = 0x6d;
						p8tx[Len + 96] = 0x66;
						p8tx[Len + 97] = 0x72;
						p8tx[Len + 98] = 0x73;
						p8tx[Len + 99] = 0x3d;

						//	模块厂商代码
#if	0
						if(n==0)
						{
							p8s=UART_3762_AFNxFn(0x03,12);
							i=p8s[0]+(p8s[1]<<8);
							p8tx[Len + 104]=i>>8;
							p8tx[Len + 105]=i;

