gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_F000.cpp
						}
						else
						{
							p8s1=(u8*)ADDR_AFN10F7;
							i=p8s1[2+7+61*m]+(p8s1[2+7+1+61*m]<<8);
							p8tx[Len + 104]=i>>8;
							p8tx[Len + 105]=i;
						
}
#else
						p8tx[Len + 101]=p8s2[11 + 2 + 15*L];;
						p8tx[Len + 100]=p8s2[12 + 2 + 15*L];;
#endif

						// ；
						p8tx[Len + 102] = 0x3b;

						// midformat=
						p8tx[Len + 103] = 0x6d;
						p8tx[Len + 104] = 0x69;
						p8tx[Len + 105] = 0x64;
						p8tx[Len + 106] = 0x66;
						p8tx[Len + 107] = 0x6f;
						p8tx[Len + 108] = 0x72;
						p8tx[Len + 109] = 0x6d;
						p8tx[Len + 110] = 0x61;
						p8tx[Len + 111] = 0x74;
						p8tx[Len + 112] = 0x3d;

						// 02
						p8tx[Len + 113] = 0x31;

						// ;
						p8tx[Len + 114] = 0x3b;
						
						//mid =
						p8tx[Len + 115] = 0x6d;
						p8tx[Len + 116] = 0x69;
						p8tx[Len + 117] = 0x64;
						p8tx[Len + 118] = 0x3d;

						// 模块ID信息		
#if 0
						if(n==0)
						{
							HexToASCII(&p8s[4],&p8tx[Len + 124],11);
						}
						else
						{
							HexToASCII(&p8s1[2+11+n*61],&p8tx[Len + 124],11);
						}
#else
						Data_Inverse((u32)p8s1+2+11+j*61,M);
						HexToASCII(&p8s1[2+11+j*61],&p8tx[Len + 119],M);
						Data_Inverse((u32)p8s1+2+11+j*61,M);	// 对 ram 直接操作，需要转回来，否则改变原有数据
#endif						
					//  从节点响应时长
//						p8tx[Len+16+p8tx[Len+15]]=DataType_long_unsigned;
//						p8tx[Len+17+p8tx[Len+15]]=0;
//						p8tx[Len+18+p8tx[Len+15]]=3;
						
					//从节点最近一次通信成功时间 6032
//						p8tx[Len+19+p8tx[Len+15]]=DataType_date_time_s;
//						// 注意7 字节
//						p8s = (u8*)ADDR_6032;
//						for(i=0;i<NUM_RMmax;i++)
//						{
//							if(Compare_DL698DataString(&p8tx[Len+7],(u8*)(ADDR_6032 +  5 + (64 * i)), 6) == 0)
//							{
//								break;
//							}
//						}
//						MR((u32)(p8tx + Len + 20 + p8tx[Len+15]),(u32)(ADDR_6032 + 20 + (64 * i)) ,7);
						
					//}
#if 0
						if(n==0)
						{
							Len+=(16+108);
						}
						else
						{
							Len+=(16+128);
						}		
#else
						Len+=(16+125);
#endif						
						LENmax_TxSPACE-=(16+125);
						Array++;//填入配置组数
						n++;
					}
					if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					{
						UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
					p8tx[1]=Array;//填入配置组数
					return Len;
				case 6:
					//属性6（从节点对象列表更新周期）∷= TI
					//更新周期：指从节点对象列表、网络拓扑信息、多网信息等更新周期
					if(LENmax_TxSPACE<4)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					//TI∷=SEQUENCE
					//{
					//   单位  ENUMERATED
					//   {
					//       秒      （0），
					//       分      （1），
					//       时      （2），
					//       日      （3），
					//       月      （4），
					//       年      （5）
					//    }，
					//    间隔值  long-unsigned
					//}
					if(LENmax_TxSPACE<4)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					MR((u32)p8tx,ADDR_F209_6,4);
					Len=4;
					return Len;
				case 7:
					//属性7（网络拓补信息，只读）::=array网络拓补单元
				#if (((USER/100)==9)||((USER/100)==17))//河南和江苏
					i=0;
					n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
					p8s=(u8*)ADDR_DATABUFF;
					//节点起始序号：每次查询必须从序号1起始查询
					while(i<n)
					{//不是从0开始
						m=n-i;
						if(m>15)
						{
							m=15;
						}
						UART_3762_AFN03F101(PORTn,i+1,m,(u8*)ADDR_DATABUFF);//(河南)查询节点台区信息(只暂停路由,没恢复);入口:StartNo=节点起始序号首帧从0开始,Num=节点数量(最大支持15个),p8Buff=数据放置缓冲
						NUMmax=p8s[0]|(p8s[1]<<8);//节点总数量
						if(n>=NUMmax)
						{
							break;
						}
						m=p8s[4];//本次应答的节点数量
						if(m==0)
						{
							break;
						}
						i+=m;
					}
					p8tx[0]=DataType_array;
					Len=2;
					Array=0;//填入配置组数
					while(1)
					{
						UART_3762_AFN10F21(PORTn,n+1,32,(u8*)ADDR_DATABUFF);//查询网络拓扑信息(只暂停路由,没恢复);入口:StartNo=节点序号从1开始,其中1为主节点,后续为从节点,Num=节点数量,p8Buff=数据放置缓冲
						p8s=(u8*)ADDR_DATABUFF;
					//上行：
						//节点总数量	BIN	2
						//节点起始序号	BIN	2
						//本次应答的节点数量n	BIN	1
						//节点1地址	BIN	6
						//节点1网络节点信息	BIN	5
						//……	……	……
						//节点n地址	BIN	6
						//节点n网络节点信息	BIN	5
						NUMmax=p8s[0]|(p8s[1]<<8);//节点总数量
						m=p8s[4];//本次应答的节点数量
						if(m==0)
						{
							break;
						}
						p8s+=5;
						while(m)
						{
							if(n>=NUMmax)
							{
								break;
							}
							if((Array>=127)||(LENmax_TxSPACE<20))//每节点字节数=2+8+2+3+3+2=20
							{//发送缓冲不够,分帧
								if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								{
									UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								else
								{
									UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
								p8tx[1]=Array;//填入配置组数
								//路由恢复
								Terminal_Router->StopFlags&=~(1<<3);//b3=UART读路由信息
								Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态;完成后自动回到0
								return Len;
							}
						//F211网络拓补单元  属性2::=structure
							p8tx[Len+0]=DataType_structure;
							p8tx[Len+1]=5;
						//{
						//节点地址   octet-string(SIZE(6)),
							p8tx[Len+2]=DataType_octet_string;
							p8tx[Len+3]=6;
							MR((u32)p8tx+Len+4,(u32)p8s,6);
							Data_Inverse((u32)p8tx+Len+4,6);//数据倒序(高低字节调换),入口Le>=2
						//节点类型 enum{主节点(0),从节点(1)},
							p8tx[Len+10]=DataType_enum;
							if(n==0)
							{
								p8tx[Len+11]=0;
							}
							else
							{
								p8tx[Len+11]=1;
							}
						//节点标识 long-unsingned,
							p8tx[Len+12]=DataType_long_unsigned;
							p8tx[Len+13]=p8s[7];
							p8tx[Len+14]=p8s[6];
						//代理节点标识 long-unsigned,
							p8tx[Len+15]=DataType_long_unsigned;
							p8tx[Len+16]=p8s[9];
							p8tx[Len+17]=p8s[8];
						//节点信息unsigned
							p8tx[Len+18]=DataType_unsigned;
							p8tx[Len+19]=p8s[10];
						//}
							p8s+=11;
							Len+=20;
							LENmax_TxSPACE-=20;
							Array++;//填入配置组数
							n++;
							m--;
						}
						if(m)
						{//完
							break;
						}
					}
					if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					{
						UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
					p8tx[1]=Array;//填入数组数
					//路由恢复
					Terminal_Router->StopFlags&=~(1<<3);//b3=UART读路由信息
					Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态;完成后自动回到0
				#else
					if(UART4Ctrl->Lock_InfoTask==0x55)//读路由网络拓扑信息等任务:0x55=锁定
					{
						UARTCtrl->Lock_InfoTask=0x55;//读路由网络拓扑信息等任务:0x55=锁定
						return 1;//表示有数据即可
					}
					else
					{
						UARTCtrl->Lock_InfoTask=0;//读路由网络拓扑信息等任务:0x55=锁定
					}
					i=0;
					n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
					p8tx[0]=DataType_array;
					Len=2;
					Array=0;//填入配置组数
					while(1)
					{
						p8s=(u8*)ADDR_AFN10F21;//从路由读取的网络拓扑信息
						//2byte 节点总数量
						//6byte 节点1地址
						//5byte 节点1网络拓扑信息
						//...
						//6byte 节点n地址
						//5byte 节点n网络拓扑信息
						NUMmax=p8s[0]|(p8s[1]<<8);//节点总数量
						m=NUMmax-n;//本次应答的节点数量
						if(m==0)
						{
							break;
						}
						p8s+=2+(11*n);
						while(m)
						{
							if(n>=NUMmax)
							{
								break;
							}
							if((Array>=127)||(LENmax_TxSPACE<20))//每节点字节数=2+8+2+3+3+2=20
							{//发送缓冲不够,分帧
								if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								{
									UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								else
								{
									UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
								p8tx[1]=Array;//填入配置组数
								return Len;
							}
						//F211网络拓补单元  属性2::=structure
							p8tx[Len+0]=DataType_structure;
							p8tx[Len+1]=5;
						//{
						//节点地址   octet-string(SIZE(6)),
							p8tx[Len+2]=DataType_octet_string;
							p8tx[Len+3]=6;
							MR((u32)p8tx+Len+4,(u32)p8s,6);
							Data_Inverse((u32)p8tx+Len+4,6);//数据倒序(高低字节调换),入口Le>=2
						//节点类型 enum{主节点(0),从节点(1)},
							p8tx[Len+10]=DataType_enum;
							if(n==0)
							{
								p8tx[Len+11]=0;
							}
							else
							{
								p8tx[Len+11]=1;
							}
						//节点标识 long-unsingned,
							p8tx[Len+12]=DataType_long_unsigned;
							p8tx[Len+13]=p8s[7];
							p8tx[Len+14]=p8s[6];
						//代理节点标识 long-unsigned,
							p8tx[Len+15]=DataType_long_unsigned;
							p8tx[Len+16]=p8s[9];
							p8tx[Len+17]=p8s[8];
						//节点信息unsigned
							p8tx[Len+18]=DataType_unsigned;
							p8tx[Len+19]=p8s[10];
						//}
							p8s+=11;
							Len+=20;
							LENmax_TxSPACE-=20;
							Array++;//填入配置组数
							n++;
							m--;
						}
						break;
					}
					if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					{
						UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
					p8tx[1]=Array;//填入数组数
				#endif
					return Len;
				case 8:
					//属性 8（多网信息，只读）∷ =structure
				//#if (USER/100)==9//河南
				#if (((USER/100)==9)||((USER/100)==17))//河南和江苏
					p8s=UART_3762_AFNxFn(0x10,111);//查询多网络信息,宽带载波频段序号等(自动暂停和恢复路由);入口:p8Buff=数据放置缓冲
				//376.2上行报文数据单元格式
					//多网络节点总数量n BIN 1
					//本节点网络标识号  BIN 3
					//本节点主节点地址  BIN 6
					//邻居节点1网络标识号  BIN 3
					//……
					//邻居节点n网络标识号  BIN 3
				#else
					if(UART4Ctrl->Lock_InfoTask==0x55)//读路由网络拓扑信息等任务:0x55=锁定
					{
						UARTCtrl->Lock_InfoTask=0x55;//读路由网络拓扑信息等任务:0x55=锁定
						return 1;//表示有数据即可
					}
					else
					{
						UARTCtrl->Lock_InfoTask=0;//读路由网络拓扑信息等任务:0x55=锁定
					}
					p8s=(u8*)ADDR_AFN10F111;
				#endif
					n=p8s[0];
					n*=3;
					n+=18;
					if(LENmax_TxSPACE<n)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
				//属性 8（多网信息，只读）∷ =structure
				//{
					p8tx[0]=DataType_structure;
					p8tx[1]=3;
				//本节点网络标识号 octet -string(SIZE(3)) ，
					p8tx[2]=DataType_octet_string;
					p8tx[3]=3;
					p8tx[4]=p8s[3];
					p8tx[5]=p8s[2];
					p8tx[6]=p8s[1];
				//本节点主地址 octet -string(SIZE(6)) ，
					p8tx[7]=DataType_octet_string;
					p8tx[8]=6;
					MR((u32)p8tx+9,(u32)p8s+4,6);
					Data_Inverse((u32)p8tx+9,6);//数据倒序(高低字节调换),入口Le>=2
				//邻居节点网络标识号 array octet -string(SIZE(3))
					p8tx[15]=DataType_array;
					n=p8s[0];
					if(n<=127)
					{
						p8tx[16]=n;
						Len=17;
					}
					else
					{
						p8tx[16]=0x81;
						p8tx[17]=n;
						Len=18;
					}
					p8s+=10;
					for(i=0;i<n;i++)
					{
						p8tx[Len+0]=DataType_octet_string;
						p8tx[Len+1]=0x03;
						p8tx[Len+2]=p8s[2];
						p8tx[Len+3]=p8s[1];
						p8tx[Len+4]=p8s[0];
						Len+=5;
						p8s+=5;
					}
				//}
					return Len;
				case 9:
					//属性 9（宽带载波频段序号）∷ =unsigned
					if(LENmax_TxSPACE<2)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8s=UART_3762_AFNxFn(0x03,16);//查询多网络信息,宽带载波频段序号等(自动暂停和恢复路由);入口:p8Buff=数据放置缓冲
					//376.2上行报文数据单元格式
					//宽带载波频段  BIN 1
					//宽带载波频段：0：1.953～11.96MHz；1： 2.441～5.615 MHz；2～255表示保留
					p8tx[0]=DataType_unsigned;
					p8tx[1]=p8s[0];
					Len=2;
					return Len;

				case 10:
					n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
					p8s=(u8*)ADDR_DATABUFF;
					//节点起始序号：每次查询必须从序号1起始查询
					p8tx[0]=DataType_array;
					Len=2;
					Array=0;//填入配置组数
					while(1)
					{
						UART_3762_AFN10F31(PORTn,n+1,15,(u8*)ADDR_DATABUFF);//查询相位信息(只暂停路由,没恢复);入口:StartNo=节点序号从1开始,其中1为主节点,后续为从节点,Num=节点数量,p8Buff=数据放置缓冲
						p8s=(u8*)ADDR_DATABUFF;
						NUMmax=p8s[0]|(p8s[1]<<8);//节点总数量
						m=p8s[4];//本次应答的节点数量
						if(m==0)
						{
							break;
						}
						p8s+=5;
						while(m)
						{
							if(n>=NUMmax)
							{
								break;
							}
							if((Array>=127)||(LENmax_TxSPACE<13))//每节点字节数
							{//发送缓冲不够,分帧
								if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								{
									UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								else
								{
									UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
								p8tx[1]=Array;//填入配置组数
								//路由恢复
								Terminal_Router->StopFlags&=~(1<<3);//b3=UART读路由信息
								Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态;完成后自动回到0
								return Len;
							}
						//节点相位信息单元  属性2::=structure
							p8tx[Len+0]=DataType_structure;
							p8tx[Len+1]=3;
						//{

							//节点序号
							p8tx[Len+2]=DataType_long_unsigned;
							p8tx[Len+3]=(n + 1)>>8;
							p8tx[Len+4]=(n + 1);

