gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_F000.cpp
							//节点地址   octet-string(SIZE(6)),
							p8tx[Len+5]=DataType_octet_string;
							p8tx[Len+6]=6;
							MR((u32)p8tx+Len+7,(u32)p8s,6);
							Data_Inverse((u32)p8tx+Len+7,6);//数据倒序(高低字节调换),入口Le>=2

							//节点相位信息},
							p8tx[Len+13]=DataType_long_unsigned;
							p8tx[Len+14]=p8s[7];
							p8tx[Len+15]=p8s[6];
						//}
							p8s+=8;
							Len+=16;
							LENmax_TxSPACE-=16;
							Array++;//填入配置组数
							n++;
							m--;
						}
						if(m)
						{//完
							break;
						}
					}
					if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					{
						UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
					p8tx[1]=Array;//填入数组数
					//路由恢复
					Terminal_Router->StopFlags&=~(1<<3);//b3=UART读路由信息
					Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态;完成后自动回到0
					return Len;
					
				case 11:
					//台区识别标志 enum{主节点(0),从节点(1)},
					if(LENmax_TxSPACE<2)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8s=UART_3762_AFNxFn(0x10,4);//查询台区识别状态读取,暂无协议读取，只支持AFN05_F6
					p8tx[0]=DataType_enum;
					if(p8s[7] & 0x08)
						p8tx[1]=1;
					else
						p8tx[1]=0;
					Len=2;
					return Len;

				case 12:
					//属性  12（节点版本信息，只读）∷=array  节点版本信息单元
#if 0
					节点版本信息单元∷=structure
					{
						节点地址  octet-string(SIZE(6))，
						节点类型  enum{主节点(0)，从节点(1)}，
						软件版本号  long-unsigned，
						软件版本日期  Date，
						模块厂商代码  visible-string(SIZE(2))，
						芯片代码  visible-string(SIZE(2))
					}				
#endif
					n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
					if(LENmax_TxSPACE<29)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					// 主节点版本信息
					p8tx[0]=DataType_array;
					p8s1=(u8*)ADDR_DATABUFF;
					MR((u32)p8s1,ADDR_F209_2,Get_DL698DataLen_S((u8*)ADDR_F209_2,0));
					
					Len=2;
					p8tx[Len+0]=DataType_structure;
					p8tx[Len+1]=6;	
					
					//节点地址	 octet-string(SIZE(6)),
					p8tx[Len+2]=DataType_octet_string;
					p8tx[Len+3]=6;
					MR((u32)p8tx+Len+4,ADDR_4001+2,6);
					Data_Inverse((u32)p8tx+Len+4,6);//数据倒序(高低字节调换),入口Le>=2

					//节点类型 enum{主节点(0),从节点(1),
					p8tx[Len+10]=DataType_enum;
					p8tx[Len+11]=0;

					//软件版本号  ,
					p8tx[Len+12]=DataType_long_unsigned;
					p8tx[Len+13]=p8s1[29];
					p8tx[Len+14]=p8s1[30];

					// 软件版本日期  Date
					p8tx[Len+15]=DataType_date;
					p8tx[Len+16]=p8s1[23];
					p8tx[Len+17]=p8s1[24];
					p8tx[Len+18]=p8s1[25];
					p8tx[Len+19]=p8s1[26];
					p8tx[Len+20]=0;
					
					//  厂商代码    visible-string(SIZE(2))，
					p8tx[Len+21]=DataType_visible_string;
					p8tx[Len+22]=2;
					p8tx[Len+23]=p8s1[16];
					p8tx[Len+24]=p8s1[17];

					//  芯片代码    visible-string(SIZE(2))，
					p8tx[Len+25]=DataType_visible_string;
					p8tx[Len+26]=2;
					p8tx[Len+27]=p8s1[20];
					p8tx[Len+28]=p8s1[21];

					Len+=29;
					LENmax_TxSPACE-=29;

					// 从节点信息
					p8s=(u8*)ADDR_AFN10F104;
					n=p8s[0];
					n|=p8s[1]<<8;
					p8s+=2;
					Array=1;//填入配置组数
					while(1)
					{
						if(n==0)
						{
							break;
						}
						while(n)
						{
							if(n >= NUMmax)
							{
								break;
							}
							if((Array>=127)||(LENmax_TxSPACE<29))//每节点字节数
							{//发送缓冲不够,分帧
								if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								{
									UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								else
								{
									UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
								}
								UARTCtrl->NEXTOADSubNum=m;//DL698分帧传输OAD内子计数
								p8tx[1]=Array;//填入配置组数
								return Len;
							}
							p8tx[Len+0]=DataType_structure;
							p8tx[Len+1]=6;	
							
							//节点地址	 octet-string(SIZE(6)),
							p8tx[Len+2]=DataType_octet_string;
							p8tx[Len+3]=6;
							MR((u32)p8tx+Len+4,(u32)p8s,6);
							Data_Inverse((u32)p8tx+Len+4,6);//数据倒序(高低字节调换),入口Le>=2

							//节点类型 enum{主节点(0),从节点(1),
							p8tx[Len+10]=DataType_enum;
							p8tx[Len+11]=1;

							//软件版本号  ,
							p8tx[Len+12]=DataType_long_unsigned;
							i=p8s[6]+(p8s[7]<<8);
							i=bcd_hex(i);
							p8tx[Len+13]=i>>8;;
							p8tx[Len+14]=i;

							// 软件版本日期  Date
							p8tx[Len+15]=DataType_date;
							i=p8s[10];	//年
							i=bcd_hex(i);
							i+=2000;
							p8tx[Len+16]=i>>8;
							p8tx[Len+17]=i;
							i=p8s[9];	//月
							i=bcd_hex(i);
							p8tx[Len+18]=i;
							i=p8s[8];	//日
							i=bcd_hex(i);
							p8tx[Len+19]=i;
							p8tx[Len+20]=0;	//周

							//  厂商代码    visible-string(SIZE(2))，
							p8tx[Len+21]=DataType_visible_string;
							p8tx[Len+22]=2;
							i=p8s[11]+(p8s[12]<<8);
							p8tx[Len+23]=i>>8;
							p8tx[Len+24]=i;
							
							//  芯片代码    visible-string(SIZE(2))，
							p8tx[Len+25]=DataType_visible_string;
							p8tx[Len+26]=2;
							i=p8s[13]+(p8s[14]<<8);
							p8tx[Len+27]=i>>8;
							p8tx[Len+28]=i;

							p8s+=15;
							Len+=29;
							LENmax_TxSPACE-=29;
							Array++;//填入配置组数
							m++;
							n--;
						}
						if(n)
						{//完
							break;
						}
					}
					if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					{
						UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					}
					UARTCtrl->NEXTOADSubNum=m;//DL698分帧传输OAD内子计数
					p8tx[1]=Array;//填入数组数
					return Len;

				case 20:
					//属性 20（网络规模）∷ =unsigned
					if(LENmax_TxSPACE<2)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8s=UART_3762_AFNxFn(0x10,9);//查询多网络信息,宽带载波频段序号等(自动暂停和恢复路由);入口:p8Buff=数据放置缓冲
					p8tx[0]=DataType_long_unsigned;
					p8tx[1]=p8s[1];
					p8tx[2]=p8s[0];
					Len=3;
					return Len;
					
				case 22:
					//拒绝节点上报使能标志
					if(LENmax_TxSPACE<2)
					{
						GET_Request_Frame(PORTn);//分帧标志
						return 0;
					}
					p8tx[0]=DataType_enum;
					i=MRR(ADDR_F209_22+1,1);
					p8tx[1]=(i&0x01);
					Len=2;
					return Len;
			#endif
				default:
					UARTCtrl->DAR=6;//对象不存在
					return 0;
			}
			//return 0;
			
		default:
			UARTCtrl->DAR=6;//对象不存在
			return 0;
	}
}


#if (USER/100)==9//河南
#if (((Project/100)==2)||((Project/100)==4))//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
//河南
//属性2电表接线错误信息表∷= array电表接线错误信息
//电表接线错误信息∷=structure
//{
//台区节点总数 unsigned，
//节点地址 octet-string，
//节点信息 bit-string(SIZE(8))，
//节点台区地址 octet-string
//}
//节点信息：b0为表档案，b1-2为台区状态，b3-5为相序，b6为线路异常，b7为保留
//a)	表档案：0表示不是集中器下发的表档案，1表示是集中器下发的表档案。
//b)	台区状态：0表示节点台区地址不确定；1表示节点台区地址和本集中器相同，属于本台区；2表示节点台区地址和本集中器地址不相同；
//c)	相序：节点所在电源相别，置0表示不确定；置1依次表示第1、2、3相（001代表A相；010代表B相；100代表C相；111代表三相）；
//d)	线路异常：从节点线路异常标记：置“1”时，表示从节点线路有异常。当电能表为单相供电时，线路异常表示零火线反接；当电能表为三相供电时，线路异常表示逆相序。
//e)	节点台区地址：节点地址归属的台区地址（包括跨台区地址），不确定全填F；
u32 GET_Request_FF10(DL698_SETLIB_TypeDef *pLib,u32 PORTn,u32 OAD,u8 *p8tx,u32 LENmax_TxSPACE)//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
{
	u32 i;
	u32 x;
	u32 Len;
	u8* p8s;
//	u8* p8d;
	UARTCtrl_TypeDef *UARTCtrl;
	u32 Array;
	u32 NUMmax;
	u32 n;
	u32 m;
	
