gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_GET_F000.cpp
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	UARTCtrl->DAR=0;//数据访问结果;成功
	if(LENmax_TxSPACE<2)
	{
		GET_Request_Frame(PORTn);//分帧标志
		return 0;
	}
	
	i=0;
	n=UARTCtrl->NEXTOADSubNum;//DL698分帧传输OAD内子计数
	p8s=(u8*)ADDR_DATABUFF;
	//节点起始序号：下行报文中首帧从0开始
	while(i<n)
	{//不是从0开始
		m=n-i;
		if(m>15)
		{
			m=15;
		}
		UART_3762_AFN03F101(PORTn,i,m,(u8*)ADDR_DATABUFF);//(河南)查询节点台区信息(只暂停路由,没恢复);入口:StartNo=节点起始序号首帧从0开始,Num=节点数量(最大支持15个),p8Buff=数据放置缓冲
		NUMmax=p8s[0]|(p8s[1]<<8);//节点总数量
		if(n>=NUMmax)
		{
			break;
		}
		m=p8s[2];//本次应答的节点数量
		if(m==0)
		{
			break;
		}
		i+=m;
	}
	
	p8tx[0]=DataType_array;
	p8tx[1]=0;
	Len=2;
	Array=0;//填入配置组数
	while(1)
	{
		UART_3762_AFN03F101(PORTn,n,15,(u8*)ADDR_DATABUFF);//(河南)查询节点台区信息(只暂停路由,没恢复);入口:StartNo=节点起始序号首帧从0开始,Num=节点数量(最大支持15个),p8Buff=数据放置缓冲
		p8s=(u8*)ADDR_DATABUFF;
//上行：
	//台区节点总数量	BIN	2
	//本次上报节点数量n(n<=15)	BIN	1
		
	//节点1地址	BCD	6
	// b7   	 b6	    b5-b3	  b2-b1	     b0	     BS	1
	//保留	线路异常	  相序	 台区状态	  表档案		
	//节点1台区地址	BCD	6
	//…	…	…
	//a)	表档案：0表示不是集中器下发的表档案，1表示是集中器下发的表档案。
	//b)	台区状态：0表示节点台区地址不确定；1表示节点台区地址和本集中器相同，属于本台区；2表示节点台区地址和本集中器地址不相同；
	//c)	相序：节点所在电源相别，置0表示不确定；置1依次表示第1、2、3相（001代表A相；010代表B相；100该表C相；111代表三相）；
	//d)	线路异常：从节点线路异常标记：置“1”时，表示从节点线路有异常。当电能表为单相供电时，线路异常表示零火线反接；当电能表为三相供电时，线路异常表示逆相序。
	//e)	节点台区地址：节点地址归属的台区地址（包括跨台区地址），不确定全填F；
		NUMmax=p8s[0]|(p8s[1]<<8);//节点总数量
		m=p8s[2];//本次应答的节点数量
		if(m==0)
		{
			break;
		}
		p8s+=3;
		while(m)
		{
			if(n>=NUMmax)
			{
				break;
			}
			if((Array>=127)||(LENmax_TxSPACE<24))//每节点字节数=
			{//发送缓冲不够,分帧
				if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
				{
					UARTCtrl->NEXT=1;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
				}
				else
				{
					UARTCtrl->NEXT=2;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
				}
				UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
				p8tx[1]=Array;//填入配置组数
				//路由恢复
				Terminal_Router->StopFlags&=~(1<<3);//b3=UART读路由信息
				Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态;完成后自动回到0
				return Len;
			}
			
		//电表接线错误信息∷=structure
			p8tx[Len+0]=DataType_structure;
			p8tx[Len+1]=4;
		//{
		//台区节点总数 unsigned，
			p8tx[Len+2]=DataType_long_unsigned;
			p8tx[Len+3]=NUMmax>>8;
			p8tx[Len+4]=NUMmax;
		//节点地址 octet-string，
			Data_Inverse((u32)p8s,6);//数据倒序(高低字节调换),入口Le>=2
			p8tx[Len+5]=DataType_octet_string;
			p8tx[Len+6]=6;
			MR((u32)p8tx+Len+7,(u32)p8s,6);
		//节点信息 bit-string(SIZE(8))，
	// b7   	 b6	    b5-b3	  b2-b1	     b0	     BS	1
	//保留	线路异常	  相序	 台区状态	  表档案		
			x=p8s[6];
			i=Bit_Inverse(x,8);//寄存器数据位倒序(高低位调换),入口:Data=寄存器数据,bit=需倒序的位个数;返回:位倒序后的数据
//			i&=0x83;
//			i|=(x&0x06)<<4;
//			i|=(x&0x38)>>1;
			p8tx[Len+13]=DataType_bit_string;
			p8tx[Len+14]=8;
			p8tx[Len+15]=i;
		//节点台区地址 octet-string
			Data_Inverse((u32)p8s+7,6);//数据倒序(高低字节调换),入口Le>=2
			p8tx[Len+16]=DataType_octet_string;
			p8tx[Len+17]=6;
			MR((u32)p8tx+Len+18,(u32)p8s+7,6);
		//}
			p8s+=13;
			Len+=24;
			LENmax_TxSPACE-=24;
			Array++;//填入配置组数
			n++;
			m--;
		}
		if(m)
		{//完
			break;
		}
	}
	if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	{
		UARTCtrl->NEXT=3;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	}
	UARTCtrl->NEXTOADSubNum=n;//DL698分帧传输OAD内子计数
	p8tx[1]=Array;//填入数组数
	//路由恢复
	Terminal_Router->StopFlags&=~(1<<3);//b3=UART读路由信息
	Terminal_Router->RouterCtrl=3;//路由器控制0=空,1=重启,2=暂停,3=恢复,4=读状态;完成后自动回到0
	return Len;
	
}
#endif
#endif










